movie_rails/app/controllers/articles_controller.rb

  def index
    @articles = Article.all.reverse
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "video", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a.mp4"], ["video", "a.mp4"], ["created_at", "2017-09-25 04:13:41.697381"], ["updated_at", "2017-09-25 04:13:41.697381"]]

  def update
    respond_to do |format|
      if @article.update(article_params) && @article.video.recreate_versions!
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "dfdf"], ["updated_at", "2017-10-02 02:00:23.506471"], ["id", 3]]